; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	infrared2 - mode
	infrared0 - mode
	image1 - mode
	infrared3 - mode
	GroundStation0 - direction
	GroundStation3 - direction
	Star4 - direction
	Star2 - direction
	GroundStation1 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Star7 - direction
	Phenomenon8 - direction
)
(:init
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star2)
	(supports instrument1 infrared0)
	(supports instrument1 infrared2)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon8)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 139)
	(supports instrument2 infrared3)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 156)
	(= (data Phenomenon5 infrared2) 268)
	(= (data Planet6 infrared2) 35)
	(= (data Star7 infrared2) 201)
	(= (data Phenomenon8 infrared2) 290)
	(= (data Phenomenon5 infrared0) 46)
	(= (data Planet6 infrared0) 60)
	(= (data Star7 infrared0) 277)
	(= (data Phenomenon8 infrared0) 179)
	(= (data Phenomenon5 image1) 78)
	(= (data Planet6 image1) 88)
	(= (data Star7 image1) 68)
	(= (data Phenomenon8 image1) 272)
	(= (data Phenomenon5 infrared3) 16)
	(= (data Planet6 infrared3) 64)
	(= (data Star7 infrared3) 231)
	(= (data Phenomenon8 infrared3) 249)
	(= (slew_time GroundStation3 GroundStation0) 30.1)
	(= (slew_time GroundStation0 GroundStation3) 30.1)
	(= (slew_time GroundStation3 GroundStation1) 3.434)
	(= (slew_time GroundStation1 GroundStation3) 3.434)
	(= (slew_time GroundStation3 Star2) 74.91)
	(= (slew_time Star2 GroundStation3) 74.91)
	(= (slew_time Star4 GroundStation0) 9.205)
	(= (slew_time GroundStation0 Star4) 9.205)
	(= (slew_time Star4 GroundStation1) 70.21)
	(= (slew_time GroundStation1 Star4) 70.21)
	(= (slew_time Star4 Star2) 52.84)
	(= (slew_time Star2 Star4) 52.84)
	(= (slew_time Star4 GroundStation3) 25)
	(= (slew_time GroundStation3 Star4) 25)
	(= (slew_time Star2 GroundStation0) 6.785)
	(= (slew_time GroundStation0 Star2) 6.785)
	(= (slew_time Star2 GroundStation1) 59.14)
	(= (slew_time GroundStation1 Star2) 59.14)
	(= (slew_time GroundStation1 GroundStation0) 33.78)
	(= (slew_time GroundStation0 GroundStation1) 33.78)
	(= (slew_time Phenomenon5 GroundStation0) 9.694)
	(= (slew_time GroundStation0 Phenomenon5) 9.694)
	(= (slew_time Phenomenon5 GroundStation1) 26.83)
	(= (slew_time GroundStation1 Phenomenon5) 26.83)
	(= (slew_time Phenomenon5 Star2) 0.2049)
	(= (slew_time Star2 Phenomenon5) 0.2049)
	(= (slew_time Phenomenon5 GroundStation3) 60.96)
	(= (slew_time GroundStation3 Phenomenon5) 60.96)
	(= (slew_time Phenomenon5 Star4) 1.623)
	(= (slew_time Star4 Phenomenon5) 1.623)
	(= (slew_time Planet6 GroundStation0) 10.01)
	(= (slew_time GroundStation0 Planet6) 10.01)
	(= (slew_time Planet6 GroundStation1) 87.8)
	(= (slew_time GroundStation1 Planet6) 87.8)
	(= (slew_time Planet6 Star2) 18.22)
	(= (slew_time Star2 Planet6) 18.22)
	(= (slew_time Planet6 GroundStation3) 31.35)
	(= (slew_time GroundStation3 Planet6) 31.35)
	(= (slew_time Planet6 Star4) 42.27)
	(= (slew_time Star4 Planet6) 42.27)
	(= (slew_time Planet6 Phenomenon5) 11.86)
	(= (slew_time Phenomenon5 Planet6) 11.86)
	(= (slew_time Star7 GroundStation0) 83.53)
	(= (slew_time GroundStation0 Star7) 83.53)
	(= (slew_time Star7 GroundStation1) 22.71)
	(= (slew_time GroundStation1 Star7) 22.71)
	(= (slew_time Star7 Star2) 5.649)
	(= (slew_time Star2 Star7) 5.649)
	(= (slew_time Star7 GroundStation3) 4.769)
	(= (slew_time GroundStation3 Star7) 4.769)
	(= (slew_time Star7 Star4) 79.53)
	(= (slew_time Star4 Star7) 79.53)
	(= (slew_time Star7 Phenomenon5) 18.99)
	(= (slew_time Phenomenon5 Star7) 18.99)
	(= (slew_time Star7 Planet6) 11.83)
	(= (slew_time Planet6 Star7) 11.83)
	(= (slew_time Phenomenon8 GroundStation0) 29.97)
	(= (slew_time GroundStation0 Phenomenon8) 29.97)
	(= (slew_time Phenomenon8 GroundStation1) 36.13)
	(= (slew_time GroundStation1 Phenomenon8) 36.13)
	(= (slew_time Phenomenon8 Star2) 43.82)
	(= (slew_time Star2 Phenomenon8) 43.82)
	(= (slew_time Phenomenon8 GroundStation3) 5.247)
	(= (slew_time GroundStation3 Phenomenon8) 5.247)
	(= (slew_time Phenomenon8 Star4) 43.11)
	(= (slew_time Star4 Phenomenon8) 43.11)
	(= (slew_time Phenomenon8 Phenomenon5) 38.9)
	(= (slew_time Phenomenon5 Phenomenon8) 38.9)
	(= (slew_time Phenomenon8 Planet6) 31.53)
	(= (slew_time Planet6 Phenomenon8) 31.53)
	(= (slew_time Phenomenon8 Star7) 81.99)
	(= (slew_time Star7 Phenomenon8) 81.99)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 Phenomenon8)
	(have_image Phenomenon5 infrared2)
	(have_image Planet6 infrared2)
	(have_image Phenomenon8 infrared2)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 groundstation1 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 139 to 102.87, (fuel-used) from 0 to 36.13
   goals met: 0 of 4
2. (turn_to satellite0 star7 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star7)
   changed: (fuel satellite0) from 102.87 to 80.16, (fuel-used) from 36.13 to 58.84
   goals met: 0 of 4
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 4
4. (turn_to satellite0 groundstation1 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 80.16 to 57.45, (fuel-used) from 58.84 to 81.55
   goals met: 0 of 4
5. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 0 of 4
6. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 4
7. (calibrate satellite0 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 0 of 4
8. (turn_to satellite0 groundstation3 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 groundstation3)
   changed: (fuel satellite0) from 57.45 to 54.016, (fuel-used) from 81.55 to 84.984
   goals met: 0 of 4
9. (turn_to satellite0 star7 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star7)
   changed: (fuel satellite0) from 54.016 to 49.247, (fuel-used) from 84.984 to 89.753
   goals met: 0 of 4
10. (turn_to satellite0 groundstation3 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation3)
   changed: (fuel satellite0) from 49.247 to 44.478, (fuel-used) from 89.753 to 94.522
   goals met: 0 of 4
11. (turn_to satellite0 star7 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star7)
   changed: (fuel satellite0) from 44.478 to 39.709, (fuel-used) from 94.522 to 99.291
   goals met: 0 of 4
12. (turn_to satellite0 star2 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 39.709 to 34.06, (fuel-used) from 99.291 to 104.94
   goals met: 0 of 4
13. (turn_to satellite0 phenomenon5 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 34.06 to 33.8551, (fuel-used) from 104.94 to 105.145
   goals met: 0 of 4
14. (take_image satellite0 phenomenon5 instrument1 infrared2)
   added: (have_image phenomenon5 infrared2)
   changed: (data_capacity satellite0) from 1000 to 732, (data-stored) from 0 to 268
   goals met: 1 of 4
15. (turn_to satellite0 planet6 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 33.8551 to 21.9951, (fuel-used) from 105.145 to 117.005
   goals met: 1 of 4
16. (take_image satellite0 planet6 instrument1 infrared2)
   added: (have_image planet6 infrared2)
   changed: (data_capacity satellite0) from 732 to 697, (data-stored) from 268 to 303
   goals met: 2 of 4
17. (turn_to satellite0 star7 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star7)
   changed: (fuel satellite0) from 21.9951 to 10.1651, (fuel-used) from 117.005 to 128.835
   goals met: 2 of 4
18. (turn_to satellite0 groundstation3 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation3)
   changed: (fuel satellite0) from 10.1651 to 5.3961, (fuel-used) from 128.835 to 133.604
   goals met: 2 of 4
19. (turn_to satellite0 phenomenon8 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon8)
   changed: (fuel satellite0) from 5.3961 to 0.1491, (fuel-used) from 133.604 to 138.851
   goals met: 3 of 4
20. (take_image satellite0 phenomenon8 instrument1 infrared2)
   added: (have_image phenomenon8 infrared2)
   changed: (data_capacity satellite0) from 697 to 407, (data-stored) from 303 to 593
   goals met: 4 of 4
